package com.wzc.privacy.compliance.plugin.utils

class Logger {

    companion object {
        fun d(message: String) {
            println(message)
        }
    }

    /**
     * 打印日志信息
     */
    fun printStartTransform() {
        println("#######################################################################")
        println("##########                                                    ")
        println("##########                欢迎使用隐私合规处理插件")
        println("##########                                                    ")
        println("#######################################################################")
        println("##########                                                    ")
        println("##########                 插件配置参数                         ")
        println("##########                                                    ")
        println("##########                                                    ")
        println("#######################################################################")
    }

    fun printEndTransform() {
        println("#######################################################################")
        println("##########                隐私合规插件扫描结束")
        println("#######################################################################")
    }


}